src/main/resources/wsdl/RequestScrubAddress.wsdl

<?xml version="1.0" encoding="UTF-8"?>

<!--
 *==========================================================================================
 *  D I R E C T V     E N T E R P R I S E     I N T E G R A T I O N 
 *==========================================================================================
 *  Service   : RequestScrubAddress
 *  Generated : 2012/08/25 03:54:09 
 *  URL       : http://
:/webservices/RequestScrubAddress/RequestScrubAddressService
 *==========================================================================================
 * Change Control
 *
 * $Log::xxx$
-->

<wsdl:definitions 
		xmlns:tns="http://ei.directv.com/schemas/envelope/v3_0" 
		xmlns:ent="http://ei.directv.com/schemas/entities/v3_1" 
		xmlns:svc="http://ei.directv.com/schemas/wsdl/propertyServices/v3_1/requestScrubAddress" 
		xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" 
		xmlns:http="http://schemas.xmlsoap.org/wsdl/http/" 
		xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" 
		xmlns:xs="http://www.w3.org/2001/XMLSchema" 
		xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" 
		xmlns:tm="http://microsoft.com/wsdl/mime/textMatching/" 
		xmlns:mime="http://schemas.xmlsoap.org/wsdl/mime/" 
		xmlns="http://schemas.xmlsoap.org/wsdl/" 
		targetNamespace="http://ei.directv.com/schemas/envelope/v3_0" 
		name="requestScrubAddress">
    <wsdl:types>
        <xs:schema targetNamespace="http://ei.directv.com/schemas/envelope/v3_0" elementFormDefault="qualified">
            <!-- 
                Include Envelope to get the basic EI Envelope structure. SOAP Structure will look very similar (use the same header, etc)
             -->
            <xs:include schemaLocation="envelope/v3.0/Envelope.xsd"/>
            <!-- 
                Import Service XSD to get the Request & Response elements.
             -->
            <xs:import namespace="http://ei.directv.com/schemas/wsdl/propertyServices/v3_1/requestScrubAddress" 
	    		schemaLocation="RequestScrubAddress.xsd"/>
        </xs:schema>
    </wsdl:types>
    <wsdl:message name="RequestScrubAddressSoapRequestBody">
    	<!-- 
        	Define a Request Body for this Service. 
		This references the svc:request element already defined in the imported schema
    	-->
        <part name="requestParameters" element="svc:request"/>
	<!-- 
        	Define a Header Part for this SOAP XML. 
		This references the ei element defined earlier
    	-->
	<part name="ei" element="tns:ei"/>
    </wsdl:message>
    <wsdl:message name="RequestScrubAddressSoapResponseBody">
    	<!-- 
        	Define a Response Body for this Service. 
		This references the svc:response element already defined in the imported schema
    	-->
        <part name="responseParameters" element="svc:response"/>
	<!-- 
        	Define a Header Part for this SOAP XML. 
		This references the ei element defined earlier
    	-->
	<part name="ei" element="tns:ei"/>
    </wsdl:message>
    <wsdl:portType name="RequestScrubAddressPortType">
    	<!--
        	Define the Port type to be used for this service. 
		This identifies the operation, and defines the input & output 
		messages for that operation
    	-->
        <wsdl:operation name="RequestScrubAddress">
            <wsdl:input message="tns:RequestScrubAddressSoapRequestBody"/>
            <wsdl:output message="tns:RequestScrubAddressSoapResponseBody"/>
        </wsdl:operation>
    </wsdl:portType>
    <wsdl:binding name="RequestScrubAddressBinding" type="tns:RequestScrubAddressPortType">
    	<!--
        	Define the Binding used by the operation defined in the portType. 
    	-->
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="RequestScrubAddress">
            <!--
	    	Define the SOAP operation with the following params
		Soap Action : http://ei.directv.com/schemas/envelope/v3_0/RequestScrubAddressPortType/RequestScrubAddress
		Style : document
            -->
            <soap:operation soapAction="http://ei.directv.com/schemas/envelope/v3_0/RequestScrubAddressPortType/RequestScrubAddress" 
	    			style="document"/>
            <!--
                We define the input to contain the header and the input message defined earlier
            -->
            <wsdl:input>
                <soap:body parts="requestParameters" use="literal" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/>
                <soap:header message="tns:RequestScrubAddressSoapRequestBody" 
			part="ei" use="literal" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/>
            </wsdl:input>
            <!--
                We define the output to contain the header and the output message defined earlier
            -->
            <wsdl:output>
                <soap:body parts="responseParameters" use="literal" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/>
                <soap:header message="tns:RequestScrubAddressSoapResponseBody" 
			part="ei" use="literal" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/>
            </wsdl:output>
        </wsdl:operation>
    </wsdl:binding>
    <wsdl:service name="RequestScrubAddressService">
    	<!--
        	Finally, we define the Service and point it to a physical end point
    	-->
        <wsdl:port name="RequestScrubAddressServicePort" binding="tns:RequestScrubAddressBinding">
            <soap:address location="http://
:/webservices/RequestScrubAddress_V3_1/RequestScrubAddress_V3_1"/>
        </wsdl:port>
    </wsdl:service>
</wsdl:definitions>

