src/test/resources/requestScubAddress_Request_Fail.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v3="http://ei.directv.com/schemas/envelope/v3_0" xmlns:req="http://ei.directv.com/schemas/wsdl/propertyServices/v3_1/requestScrubAddress" xmlns:v31="http://ei.directv.com/schemas/entities/v3_1">
   <soapenv:Header>
      <v3:ei>
         <v3:type>request</v3:type>
         <v3:service>
            <v3:name>?</v3:name>
            <v3:version>?</v3:version>
         </v3:service>
         <v3:originator>?</v3:originator>
         <!--Optional:-->
         <v3:businessProcessName>?</v3:businessProcessName>
         <!--Optional:-->
         <v3:servicerInfo>
            <!--Optional:-->
            <v3:servicerId>?</v3:servicerId>
            <!--Optional:-->
            <v3:primaryOwner>?</v3:primaryOwner>
            <!--Optional:-->
            <v3:secondaryOwner>?</v3:secondaryOwner>
         </v3:servicerInfo>
         <v3:requestDateTime>?</v3:requestDateTime>
         <!--Optional:-->
         <v3:sourceSystemTransactionId>?</v3:sourceSystemTransactionId>
         <!--Optional:-->
         <v3:sequenceNumber>?</v3:sequenceNumber>
         <!--Optional:-->
         <v3:user>
            <v3:id>?</v3:id>
            <!--Optional:-->
            <v3:group>?</v3:group>
         </v3:user>
         <!--Optional:-->
         <v3:transactionReference>?</v3:transactionReference>
         <!--Optional:-->
         <v3:expirationSeconds>?</v3:expirationSeconds>
         <!--Optional:-->
         <v3:additionalParameters>
            <!--1 or more repetitions:-->
            <v3:param>
               <v3:name>?</v3:name>
               <!--Zero or more repetitions:-->
               <v3:value>?</v3:value>
            </v3:param>
         </v3:additionalParameters>
         <!--Optional:-->
         <v3:result>
            <v3:status>?</v3:status>
            <v3:provider>EI</v3:provider>
            <!--Optional:-->
            <v3:detail>
               <v3:code>?</v3:code>
               <v3:text>?</v3:text>
               <v3:severity>unknown</v3:severity>
               <v3:category>unknown</v3:category>
               <!--Optional:-->
               <v3:subcategory>?</v3:subcategory>
               <v3:dataState>unknown</v3:dataState>
               <v3:retryAllowed>false</v3:retryAllowed>
               <!--Optional:-->
               <v3:additionalInformation>?</v3:additionalInformation>
            </v3:detail>
            <!--Zero or more repetitions:-->
            <v3:additionalMessages>
               <v3:code>?</v3:code>
               <v3:text>?</v3:text>
               <v3:severity>unknown</v3:severity>
               <v3:category>unknown</v3:category>
               <!--Optional:-->
               <v3:subcategory>?</v3:subcategory>
               <!--Optional:-->
               <v3:additionalInformation>?</v3:additionalInformation>
               <!--Optional:-->
               <v3:inputContext>?</v3:inputContext>
            </v3:additionalMessages>
         </v3:result>
      </v3:ei>
   </soapenv:Header>
   <soapenv:Body>
      <req:request>
         <!--Optional:-->
         <v31:customData>
            <!--Zero or more repetitions:-->
            <v31:paramKVPair>
               <v31:name>?</v31:name>
               <!--Zero or more repetitions:-->
               <v31:value>?</v31:value>
            </v31:paramKVPair>
         </v31:customData>
         <!--Optional:-->
         <v31:messageList count="?">
            <!--Zero or more repetitions:-->
            <v31:message>
               <!--Optional:-->
               <v31:messageStatus>?</v31:messageStatus>
               <!--Optional:-->
               <v31:provider>?</v31:provider>
               <!--Optional:-->
               <v31:messageDetail>
                  <!--Optional:-->
                  <v31:messageCode>?</v31:messageCode>
                  <!--Optional:-->
                  <v31:messageText>?</v31:messageText>
                  <!--Optional:-->
                  <v31:messageSeverity>?</v31:messageSeverity>
                  <!--Optional:-->
                  <v31:messageCategory>?</v31:messageCategory>
                  <!--Optional:-->
                  <v31:additionalInformation>?</v31:additionalInformation>
               </v31:messageDetail>
            </v31:message>
         </v31:messageList>
         <!--Optional:-->
         <v31:checkServiceFlag>?</v31:checkServiceFlag>
         <!--Optional:-->
         <v31:overrideCustomerAddressFlag>?</v31:overrideCustomerAddressFlag>
         <req:address>
            <v31:streetNumber>?</v31:streetNumber>
            <req:streetName>?</req:streetName>
            <!--Optional:-->
            <v31:address2>?</v31:address2>
            <!--Optional:-->
            <v31:secondaryUnitDesignator>?</v31:secondaryUnitDesignator>
            <!--Optional:-->
            <v31:secondaryUnitNumber>?</v31:secondaryUnitNumber>
            <!--Optional:-->
            <v31:city>?</v31:city>
            <!--Optional:-->
            <v31:state>?</v31:state>
            <v31:zipCode>?</v31:zipCode>
         </req:address>
      </req:request>
   </soapenv:Body>
</soapenv:Envelope>